Revit 2027 API
ExporterIFCUtils.IsCurveFromOtherElementSketch Method
 Identifies if the given curve element is generated by another element's sketch, or if it represents an independent curve element accessible directly by the user.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCurveFromOtherElementSketch(
	CurveElement curveElement
)
Public Shared Function IsCurveFromOtherElementSketch (
	curveElement As CurveElement
) As Boolean
public:
static bool IsCurveFromOtherElementSketch(
	CurveElement^ curveElement
)
static member IsCurveFromOtherElementSketch :
        curveElement : CurveElement -> bool
Parameters
curveElement CurveElement
 The curve element.
Return Value
Boolean
 True if the curve element was generated by a sketch, false if it is independent.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace